In [2]:
import pandas as pd

In [3]:
dic = {
    "Train No.": [12322, 12534, 125654, 564523],
    "Speed": [34, 134, 67, 87],
    "City": ["Rampur", "Kolkata", "Bareilly", "Antarctica"]
}

In [6]:
harry = pd.DataFrame(dic)
harry

   Train No.  Speed        City
0      12322     34      Rampur
1      12534    134     Kolkata
2     125654     67    Bareilly
3     564523     87  Antarctica

In [7]:
harry.to_csv("harry.csv", index=False)

In [8]:
harry = pd.read_csv("harry.csv")
harry

   Train No.  Speed        City
0      12322     34      Rampur
1      12534    134     Kolkata
2     125654     67    Bareilly
3     564523     87  Antarctica

In [9]:
harry["Speed"]

0     34
1    134
2     67
3     87
Name: Speed, dtype: int64

In [10]:
harry["Speed"][0]

34

In [11]:
harry["Speed"][0] = 50 #to change the value
harry

C:\Users\Abdul\AppData\Local\Temp\ipykernel_2952\3149874996.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry["Speed"][0] = 50 #to change the value

   Train No.  Speed        City
0      12322     50      Rampur
1      12534    134     Kolkata
2     125654     67    Bareilly
3     564523     87  Antarctica

In [12]:
harry.to_csv("harry.csv", index=False) #to save the updated value

In [13]:
harry

   Train No.  Speed        City
0      12322     50      Rampur
1      12534    134     Kolkata
2     125654     67    Bareilly
3     564523     87  Antarctica

In [14]:
harry.index = ["Fisrt", "Second", "Third", "Fourth"] #to rename of index
harry

        Train No.  Speed        City
Fisrt       12322     50      Rampur
Second      12534    134     Kolkata
Third      125654     67    Bareilly
Fourth     564523     87  Antarctica